---
title: FamilyThermalProperties
classe: Autodesk.Revit.DB.FamilyThermalProperties
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# FamilyThermalProperties

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String AnalyticConstructionName { get; }` | `familyThermalProperties.AnalyticConstructionName` | String |
| `String AnalyticConstructionTypeId { get; }` | `familyThermalProperties.AnalyticConstructionTypeId` | String |
| `Double HeatTransferCoefficient { get; }` | `familyThermalProperties.HeatTransferCoefficient` | Double |
| `Boolean IsValidObject { get; }` | `familyThermalProperties.IsValidObject` | Boolean |
| `Double SolarHeatGainCoefficient { get; }` | `familyThermalProperties.SolarHeatGainCoefficient` | Double |
| `Double ThermalResistance { get; }` | `familyThermalProperties.ThermalResistance` | Double |
| `Double VisualLightTransmittance { get; }` | `familyThermalProperties.VisualLightTransmittance` | Double |
| `Void Dispose()` | `familyThermalProperties.Dispose()` | Void |
| `FamilyThermalProperties Find(Document, String)` | `FamilyThermalProperties.Find(pADoc, constructionId)` | FamilyThermalProperties |
| `Boolean IsValid()` | `familyThermalProperties.IsValid()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```